#  Home Work 05.11.17

import math
print ("Домашнее Задание 05.11.17")

print("------------------------------------------------------------------------------------------------------")
print("Задание №1 Найти результат выражения для произвольных значений a,b,c: a + b * ( c / 2 )")
a = 10
b = 20
c = 3
x = a + b * (c / 2)
print("Решение уравнения при a = %d,  b = %d, c = %d равно %d" %
(a, b, c, x))
print()
print("------------------------------------------------------------------------------------------------------")

print("Задание №2 Найти результат выражения для произвольных значений a,b: (a^2 + b^2) % 2")
a = 2
b = 3
x = (a**2 + b**2) % 2
print("Решение уравнения при a = %d,  b = %d, равно %d" %
(a, b, x))
print()
print("------------------------------------------------------------------------------------------------------")

print("Задание №3 Найти результат выражения для произвольных значений a,b,c: ( a + b ) / 12 * c % 4 + b")
a = 10
b = 20
c = 3
x = (a + b) / 12 * c % 4 + b
print("Решение уравнения при a = %d,  b = %d, c = %d равно %d" %
(a, b, c, x))
print("------------------------------------------------------------------------------------------------------")
print()

print("Задание №4 Найти результат выражения для произвольных значений a,b,c: (a - b * c ) / ( a + b ) % c")
a = 10
b = 20
c = 3
x = (a - b * c) / (a + b) % c
print("Решение уравнения при a = %d,  b = %d, c = %d равно %d" %
(a, b, c, x))
print("------------------------------------------------------------------------------------------------------")
print()

print("Задание №5 Найти результат выражения для произвольных значений a,b,c: | a - b | /( a + b)^3 - cos( c )")
a = 10
b = 20
c = 3
x = math.fabs(a - b)/(a + b)**3 - math.cos(c)
print("Решение уравнения при a = %d,  b = %d, c = %d равно %d" %
(a, b, c, x))
print("------------------------------------------------------------------------------------------------------")
print()
print("Задание №6 Найти результат выражения для произвольных значений a,b,c: ( ln( 1 + c ) / -b )^4 + | a |")
a = 10
b = 20
c = 3
x = (math.log1p(1 + c) / -b)**4+math.fabs(a)
print("Решение уравнения при a = %d,  b = %d, c = %d равно %.2f" %
(a, b, c, x))